---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips.LipLength
source: html/c57b8428-afe0-adcc-ed8e-4571a2a81ac3.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips.LipLength Property

Lip segment length.

## Syntax (C#)
```csharp
public double LipLength { get; set; }
```